# Fall 2024 Data Science Track: Week 2 - Data Cleaning Exercise

## Packages, Packages, Packages!

Import *all* the things here! You need the standard stuff: `pandas` and `numpy`.

If you got more stuff you want to use, add them here too. üôÇ

In [72]:
import pandas as pd
import numpy

## Introduction

With the packages out of the way, now you will be working with the following data sets:

* `food_coded.csv`: [Food choices](https://www.kaggle.com/datasets/borapajo/food-choices?select=food_coded.csv) from Kaggle
* `Ask A Manager Salary Survey 2021 (Responses) - Form Responses 1.tsv`: [Ask A Manager Salary Survey 2021 (Responses)](https://docs.google.com/spreadsheets/d/1IPS5dBSGtwYVbjsfbaMCYIWnOuRmJcbequohNxCyGVw/view?&gid=1625408792) as *Tab Separated Values (.tsv)* from Google Docs

Each one poses different challenges. But you‚Äôll‚Äïof course‚Äïovercome them with what you learned in class! üòâ

## Food Choices Data Set

### Load the Data

In [73]:
# Load the Food choices data set into a variable (e.g., df_food).

food_data_set_path = '../data/food_coded.csv'

df_food = pd.read_csv(food_data_set_path)

### Explore the Data

How much data did you just load?

In [74]:
df_food #125 rows x 61 cols

,GPA,Gender,breakfast,calories_chicken,calories_day,calories_scone,coffee,comfort_food,comfort_food_reasons,comfort_food_reasons_coded,...,soup,sports,thai_food,tortilla_calories,turkey_calories,type_sports,veggies_day,vitamins,waffle_calories,weight
0,2.4,2,1,430,NaN,315.0,1,none,we dont have comfort,9.0,...,1.0,1.0,1,1165.0,345,car racing,5,1,1315,187
1,3.654,1,1,610,3.0,420.0,2,"chocolate, chips, ice cream","Stress, bored, anger",1.0,...,1.0,1.0,2,725.0,690,Basketball,4,2,900,155
2,3.3,1,1,720,4.0,420.0,2,"frozen yogurt, pizza, fast food","stress, sadness",1.0,...,1.0,2.0,5,1165.0,500,none,5,1,900,I'm not answering this.
3,3.2,1,1,430,3.0,420.0,2,"Pizza, Mac and cheese, ice cream",Boredom,2.0,...,1.0,2.0,5,725.0,690,NaN,3,1,1315,"Not sure, 240"
4,3.5,1,1,720,2.0,420.0,2,"Ice cream, chocolate, chips","Stress, boredom, cravings",1.0,...,1.0,1.0,4,940.0,500,Softball,4,2,760,190
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
120,3.5,1,1,610,4.0,420.0,2,"wine. mac and cheese, pizza, ice cream",boredom and sadness,NaN,...,1.0,1.0,5,940.0,500,Softball,5,1,1315,156
121,3,1,1,265,2.0,315.0,2,Pizza / Wings / Cheesecake,Loneliness / Homesick / Sadness,NaN,...,1.0,NaN,4,940.0,500,basketball,5,2,1315,180
122,3.882,1,1,720,NaN,420.0,1,"rice, potato, seaweed soup",sadness,NaN,...,1.0,2.0,5,580.0,690,none,4,2,1315,120
123,3,2,1,720,4.0,420.0,1,"Mac n Cheese, Lasagna, Pizza","happiness, they are some of my favorite foods",NaN,...,2.0,2.0,1,940.0,500,NaN,3,1,1315,135
124,3.9,1,1,430,NaN,315.0,2,"Chocolates, pizza, and Ritz.","hormones, Premenstrual syndrome.",NaN,...,1.0,2.0,2,725.0,345,NaN,4,2,575,135

What are the columns and their types in this data set?

In [75]:
# Show the column names and their types.

df_food.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 125 entries, 0 to 124
Data columns (total 61 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   GPA                           123 non-null    object
 1   Gender                        125 non-null    int64
 2   breakfast                     125 non-null    int64
 3   calories_chicken              125 non-null    int64
 4   calories_day                  106 non-null    float64
 5   calories_scone                124 non-null    float64
 6   coffee                        125 non-null    int64
 7   comfort_food                  124 non-null    object
 8   comfort_food_reasons          123 non-null    object
 9   comfort_food_reasons_coded    106 non-null    float64
 10  cook                          122 non-null    float64
 11  comfort_food_reasons_coded.1  125 non-null    int64
 12  cuisine                       108 non-null    float64
 13  diet_current                  124 non-null    object
 14  diet_current_coded            125 non-null    int64
 15  drink                         123 non-null    float64
 16  eating_changes                122 non-null    object
 17  eating_changes_coded          125 non-null    int64
 18  eating_changes_coded1         125 non-null    int64
 19  eating_out                    125 non-null    int64
 20  employment                    116 non-null    float64
 21  ethnic_food                   125 non-null    int64
 22  exercise                      112 non-null    float64
 23  father_education              124 non-null    float64
 24  father_profession             122 non-null    object
 25  fav_cuisine                   123 non-null    object
 26  fav_cuisine_coded             125 non-null    int64
 27  fav_food                      123 non-null    float64
 28  food_childhood                124 non-null    object
 29  fries                         125 non-null    int64
 30  fruit_day                     125 non-null    int64
 31  grade_level                   125 non-null    int64
 32  greek_food                    125 non-null    int64
 33  healthy_feeling               125 non-null    int64
 34  healthy_meal                  124 non-null    object
 35  ideal_diet                    124 non-null    object
 36  ideal_diet_coded              125 non-null    int64
 37  income                        124 non-null    float64
 38  indian_food                   125 non-null    int64
 39  italian_food                  125 non-null    int64
 40  life_rewarding                124 non-null    float64
 41  marital_status                124 non-null    float64
 42  meals_dinner_friend           122 non-null    object
 43  mother_education              122 non-null    float64
 44  mother_profession             123 non-null    object
 45  nutritional_check             125 non-null    int64
 46  on_off_campus                 124 non-null    float64
 47  parents_cook                  125 non-null    int64
 48  pay_meal_out                  125 non-null    int64
 49  persian_food                  124 non-null    float64
 50  self_perception_weight        124 non-null    float64
 51  soup                          124 non-null    float64
 52  sports                        123 non-null    float64
 53  thai_food                     125 non-null    int64
 54  tortilla_calories             124 non-null    float64
 55  turkey_calories               125 non-null    int64
 56  type_sports                   99 non-null     object
 57  veggies_day                   125 non-null    int64
 58  vitamins                      125 non-null    int64
 59  waffle_calories               125 non-null    int64
 60  weight                        123 non-null    object
dtypes: float64(20), int64(27), object(14)
memory usage: 59.7+ KB

### Clean the Data

Perhaps we‚Äôd like to know more another day, but the team is really interested in just the relationship between calories (`calories_day`) and weight. ‚Ä¶and maybe gender.

Can you remove the other columns?

In [76]:
data = ['calories_day', 'weight', 'Gender']

df_food = df_food[data]

df_food

     calories_day                    weight  Gender
0             NaN                       187       2
1             3.0                       155       1
2             4.0  I'm not answering this.        1
3             3.0             Not sure, 240       1
4             2.0                       190       1
..            ...                       ...     ...
120           4.0                       156       1
121           2.0                       180       1
122           NaN                       120       1
123           4.0                       135       2
124           NaN                       135       1

[125 rows x 3 columns]

What about `NaN`s? How many are there?

In [77]:
# Count 'em.
df_food.isna().sum()

calories_day    19
weight           2
Gender           0
dtype: int64

We gotta remove those `NaN`s‚Äïthe entire row.

In [78]:
# Drop 'em.
df_food = df_food.dropna()

But what about the weird non-numeric values in the column obviously meant for numeric data?

Notice the data type of that column from when you got the types of all the columns?

If only we could convert the column to a numeric type and drop the rows with invalid values. ü§î

In [79]:
# Fix that.
df_food['calories_day'] = pd.to_numeric(df_food['calories_day'], errors='coerce')
df_food = df_food.dropna()

/var/folders/m6/nzr_jy21479579073nm09q3m0000gn/T/ipykernel_54263/353942866.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_food['calories_day'] = pd.to_numeric(df_food['calories_day'], errors='coerce')

Now this data seems reasonably clean for our purposes! üòÅ

Let‚Äôs save it somewhere to be shipped off to another teammate. üíæ

In [80]:
# Savey save!
df_food.to_csv('../data/food_cleaned.csv', index=False)

## Ask a Manager Salary Survey 2021 (Responses) Data Set

### Load the Data

In [81]:
# Load the Ask A Manager Salary Survey 2021 (Responses) data set into a variable (e.g., df_salary).
salary_data_path = '../data/Ask A Manager Salary Survey 2021 (Responses) - Form Responses 1.tsv'
df_salary = pd.read_csv(salary_data_path, sep='\t')

Was that hard? üôÉ

#### rename the file to something that is better for all systems.  
* No spaces in filename (can use '_')
* all lower case

### Explore

You know the drill.

How much data did you just load?

In [82]:
# Count by hand. I'm dead serious.
print(f"Number of rows: {len(df_salary)}")
print(f"Number of columns: {len(df_salary.columns)}")
print("\nShape: ", df_salary.shape)

Number of rows: 28062
Number of columns: 18

Shape:  (28062, 18)

What are the columns and their types?

In [83]:
# Show the column names and their types.
print("Column names:")
for col in df_salary.columns:
    print(f"'{col}'")

print("\nColumn types:")
df_salary.info()

Column names:
'Timestamp'
'How old are you?'
'What industry do you work in?'
'Job title'
'If your job title needs additional context, please clarify here:'
'What is your annual salary? (You'll indicate the currency in a later question. If you are part-time or hourly, please enter an annualized equivalent -- what you would earn if you worked the job 40 hours a week, 52 weeks a year.)'
'How much additional monetary compensation do you get, if any (for example, bonuses or overtime in an average year)? Please only include monetary compensation here, not the value of benefits.'
'Please indicate the currency'
'If "Other," please indicate the currency here: '
'If your income needs additional context, please provide it here:'
'What country do you work in?'
'If you're in the U.S., what state do you work in?'
'What city do you work in?'
'How many years of professional work experience do you have overall?'
'How many years of professional work experience do you have in your field?'
'What is your highest level of education completed?'
'What is your gender?'
'What is your race? (Choose all that apply.)'

Column types:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28062 entries, 0 to 28061
Data columns (total 18 columns):
 #   Column                                                                                                                                                                                                                                Non-Null Count  Dtype
---  ------                                                                                                                                                                                                                                --------------  -----
 0   Timestamp                                                                                                                                                                                                                             28062 non-null  object
 1   How old are you?                                                                                                                                                                                                                      28062 non-null  object
 2   What industry do you work in?                                                                                                                                                                                                         27988 non-null  object
 3   Job title                                                                                                                                                                                                                             28061 non-null  object
 4   If your job title needs additional context, please clarify here:                                                                                                                                                                      7262 non-null   object
 5   What is your annual salary? (You'll indicate the currency in a later question. If you are part-time or hourly, please enter an annualized equivalent -- what you would earn if you worked the job 40 hours a week, 52 weeks a year.)  28062 non-null  object
 6   How much additional monetary compensation do you get, if any (for example, bonuses or overtime in an average year)? Please only include monetary compensation here, not the value of benefits.                                        20766 non-null  float64
 7   Please indicate the currency                                                                                                                                                                                                          28062 non-null  object
 8   If "Other," please indicate the currency here:                                                                                                                                                                                        206 non-null    object
 9   If your income needs additional context, please provide it here:                                                                                                                                                                      3042 non-null   object
 10  What country do you work in?                                                                                                                                                                                                          28062 non-null  object
 11  If you're in the U.S., what state do you work in?                                                                                                                                                                                     23039 non-null  object
 12  What city do you work in?                                                                                                                                                                                                             27980 non-null  object
 13  How many years of professional work experience do you have overall?                                                                                                                                                                   28062 non-null  object
 14  How many years of professional work experience do you have in your field?                                                                                                                                                             28062 non-null  object
 15  What is your highest level of education completed?                                                                                                                                                                                    27840 non-null  object
 16  What is your gender?                                                                                                                                                                                                                  27891 non-null  object
 17  What is your race? (Choose all that apply.)                                                                                                                                                                                           27885 non-null  object
dtypes: float64(1), object(17)
memory usage: 3.9+ MB

Oh‚Ä¶ Ugh! Give these columns easier names to work with first. üôÑ

In [84]:
# Rename 'em.
column_mapping = {
    'Timestamp': 'timestamp',
    'How old are you?': 'age',
    'What industry do you work in?': 'industry',
    'Job title': 'title',
    'If your job title needs additional context, please clarify here:': 'title_context',
    "What is your annual salary? (You'll indicate the currency in a later question. If you are part-time or hourly, please enter an annualized equivalent -- what you would earn if you worked the job 40 hours a week, 52 weeks a year.)": 'salary',
    'How much additional monetary compensation do you get, if any (for example, bonuses or overtime in an average year)? Please only include monetary compensation here, not the value of benefits.': 'additional_compensation',
    'Please indicate the currency': 'currency',
    'If "Other," please indicate the currency here: ': 'other_currency',
    'If your income needs additional context, please provide it here:': 'salary_context',
    'What country do you work in?': 'country',
    "If you're in the U.S., what state do you work in?": 'state',
    'What city do you work in?': 'city',
    'How many years of professional work experience do you have overall?': 'total_yoe',
    'How many years of professional work experience do you have in your field?': 'field_yoe',
    'What is your highest level of education completed?': 'highest_education_completed',
    'What is your gender?': 'gender',
    'What is your race? (Choose all that apply.)': 'race'
}

df_salary = df_salary.rename(columns=column_mapping)

It‚Äôs a lot, and that should not have been easy. üòè

You‚Äôre going to have a gander at the computing/tech subset first because thats *your* industry. But first, what value corresponds to that `industry`?

In [85]:
# List the unique industries and a count of their instances.
industry_counts = df_salary['industry'].value_counts()
print("Top 10 industries by count:")
print(industry_counts.head(10))

Top 10 industries by count:
industry
Computing or Tech                       4699
Education (Higher Education)            2464
Nonprofits                              2419
Health care                             1896
Government and Public Administration    1889
Accounting, Banking & Finance           1809
Engineering or Manufacturing            1695
Marketing, Advertising & PR             1133
Law                                     1097
Business or Consulting                   852
Name: count, dtype: int64

That value among the top 5 is what you‚Äôre looking for innit? Filter out all the rows not in that industry and save it into a new dataframe.

In [86]:
# Filtery filter. (Save it to a new variable, df_salary_tech.)
df_salary_tech = df_salary[df_salary['industry'] == 'Computing or Tech']

Do a sanity check to make sure that the only values you kept are the one you are filtered for.

In [87]:
# Sanity Check
print("Unique industries in filtered dataset:")
print(df_salary_tech['industry'].unique())
print("\nNumber of records:", len(df_salary_tech))

Unique industries in filtered dataset:
['Computing or Tech']

Number of records: 4699

We are very interested in salary figures. But how many dollars üíµ is a euro üí∂ or a pound üí∑? That sounds like a problem for another day. ü´†

For now, let‚Äôs just look at U.S. dollars (`'USD'`).

In [88]:
# Filtery filter for just the jobs that pay in USD!
df_salary_tech = df_salary_tech[df_salary_tech['currency'] == 'USD']

What we really want know is how each U.S. city pays in tech. What value in `country` represents the United States of America?

In [89]:
# We did filter for USD, so if we do a count of each unique country in descending count order, the relevant value(s) should show up at the top.
country_counts = df_salary_tech['country'].value_counts()
print("Top 20 countries by count:")
print(country_counts.head(20))

Top 20 countries by count:
country
United States                1576
USA                          1222
US                            412
U.S.                          108
United States of America       90
United States                  68
Usa                            59
USA                            56
usa                            28
United states                  23
united states                  14
Us                             12
us                              9
U.S.A.                          7
United States of America        7
Israel                          5
Canada                          4
UnitedStates                    2
New Zealand                     2
united States                   2
Name: count, dtype: int64

### Clean the Data

Well, we can‚Äôt get our answers with what we currently have, so you‚Äôll have to make some changes.

Let‚Äôs not worry about anything below the first 5 values for now. Convert the top 5 to a single canonical value‚Äïsay, `'US'`, which is nice and short.

In [90]:
# Replace them all with 'US'.
us_variants = ['United States', 'USA', 'US', 'U.S.', 'United States of America', 'United states',
               'Usa', 'usa', 'united states', 'Us', 'us', 'U.S.A.', 'UnitedStates', 'united States']

for variant in us_variants:
    df_salary_tech.loc[df_salary_tech['country'] == variant, 'country'] = 'US'

Have a look at the count of each unique country again now.

In [91]:
# Count again.
country_counts = df_salary_tech['country'].value_counts()
print("Countries after cleanup:")
print(country_counts)

Countries after cleanup:
country
US                           3564
United States                  68
USA                            56
United States of America        7
Israel                          5
                             ...
Uruguay                         1
Canada                          1
United Stateds                  1
ISA                             1
Burma                           1
Name: count, Length: 63, dtype: int64

Did you notice anything interesting?

In [92]:
# BONUS CREDIT: resolve [most of] those anomalous cases too without exhaustively taking every variant literally into account.
def standardize_us(country):
    if pd.isna(country):
        return country

    country = str(country).strip().lower()

    # Check if it's some variant of 'United States'
    if ('united' in country and 'state' in country) or \
       any(us_var in country for us_var in ['us', 'usa', 'u.s', 'u.s.a']):
        return 'US'

    return country

# Apply the standardization
df_salary_tech['country'] = df_salary_tech['country'].apply(standardize_us)

In [93]:
# BONUS CREDIT: if you've resolved it, let's see how well you did by counting the number of instances of each unique value.
country_counts = df_salary_tech['country'].value_counts()
print("Top 20 countries after cleanup:")
print(country_counts.head(20))

Top 20 countries after cleanup:
country
US                3720
israel               5
canada               5
denmark              2
spain                2
singapore            2
united kingdom       2
india                2
brazil               2
new zealand          2
poland               2
unite states         2
nigeria              2
france               2
japan                1
united stares        1
romania              1
jamaica              1
china                1
unites states        1
Name: count, dtype: int64

It‚Äôs looking good so far. Let‚Äôs find out the minimum, mean, and maximum (in that order) salary by state, sorted by the mean in descending order.

In [94]:
# Find the minimum, mean, and maximum salary in USD by U.S. state.

Well, pooh! We forgot that `salary` isn‚Äôt numeric. Something wrong must be fixed.

In [95]:
# Fix it.
# First, let's clean up the salary column
df_salary_tech['salary'] = df_salary_tech['salary'].replace('[\$,]', '', regex=True)
df_salary_tech['salary'] = pd.to_numeric(df_salary_tech['salary'], errors='coerce')

<>:3: SyntaxWarning: invalid escape sequence '\$'
<>:3: SyntaxWarning: invalid escape sequence '\$'
/var/folders/m6/nzr_jy21479579073nm09q3m0000gn/T/ipykernel_54263/847955200.py:3: SyntaxWarning: invalid escape sequence '\$'
  df_salary_tech['salary'] = df_salary_tech['salary'].replace('[\$,]', '', regex=True)

Let‚Äôs try that again.

In [96]:
# Try it again. Yeah!
# Filter for US records only
us_data = df_salary_tech[df_salary_tech['country'] == 'US']

# Group by state and calculate statistics
state_stats = us_data.groupby('state')['salary'].agg(['min', 'mean', 'max']).round(2)
state_stats = state_stats.sort_values('mean', ascending=False)

print("Salary statistics by state (sorted by mean salary):")
print(state_stats)

Salary statistics by state (sorted by mean salary):
                                min       mean      max
state
Michigan, Texas, Washington  340000  340000.00   340000
California, Oregon           200000  200000.00   200000
California, Colorado         176000  176000.00   176000
Georgia, Massachusetts       175000  175000.00   175000
Florida                       28800  157457.23  2600000
...                             ...        ...      ...
Louisiana                     35360   83269.09   150000
Massachusetts, Pennsylvania   83000   83000.00    83000
Arkansas                      55000   81682.30   144000
California, Maryland          81500   81500.00    81500
Alabama, Montana              72000   72000.00    72000

[66 rows x 3 columns]

That did the trick! Now let‚Äôs narrow this to data 2021 and 2022 just because (lel). *(Hint: that timestamp column may not be a temporal type right now.)*

In [97]:
# Filter the data to within 2021, 2022, or 2023, saving the DataFrame to a new variable, and generate the summary again.

# Convert timestamp to datetime
df_salary_tech['timestamp'] = pd.to_datetime(df_salary_tech['timestamp'])

# Create a filtered DataFrame
df_recent = df_salary_tech[
    (df_salary_tech['timestamp'].dt.year >= 2021) &
    (df_salary_tech['timestamp'].dt.year <= 2022) &
    (df_salary_tech['country'] == 'US')
]

# Calculate statistics
state_stats_recent = df_recent.groupby('state')['salary'].agg(['min', 'mean', 'max']).round(2)
state_stats_recent = state_stats_recent.sort_values('mean', ascending=False)

print("Salary statistics by state for 2021-2022 (sorted by mean salary):")
print(state_stats_recent)

Salary statistics by state for 2021-2022 (sorted by mean salary):
                                  min       mean     max
state
Michigan, Texas, Washington    340000  340000.00  340000
California, Oregon             200000  200000.00  200000
California, Colorado           176000  176000.00  176000
Georgia, Massachusetts         175000  175000.00  175000
Alabama, District of Columbia  156000  156000.00  156000
...                               ...        ...     ...
Louisiana                       35360   83269.09  150000
Massachusetts, Pennsylvania     83000   83000.00   83000
Arkansas                        55000   81682.30  144000
California, Maryland            81500   81500.00   81500
Alabama, Montana                72000   72000.00   72000

[66 rows x 3 columns]

## Bonus

Clearly, we do not have enough data to produce useful figures for the level of specificity you‚Äôve now reached. What do you notice about Delaware and West Virginia?

Let‚Äôs back out a bit and return to `df_salary` (which was the loaded data with renamed columns but *sans* filtering).

### Bonus #0

Apply the same steps as before to `df_salary`, but do not filter for any specific industry. Do perform the other data cleaning stuff, and get to a point where you can generate the minimum, mean, and maximum by state.

In [98]:
# Apply same steps to full dataset
# Clean salary data
df_salary['salary'] = df_salary['salary'].replace('[\$,]', '', regex=True)
df_salary['salary'] = pd.to_numeric(df_salary['salary'], errors='coerce')

# Clean country data
df_salary['country'] = df_salary['country'].apply(standardize_us)

# Filter for US and USD
df_salary_clean = df_salary[
    (df_salary['country'] == 'US') &
    (df_salary['currency'] == 'USD')
]

# Calculate statistics
all_state_stats = df_salary_clean.groupby('state')['salary'].agg(['min', 'mean', 'max']).round(2)
all_state_stats = all_state_stats.sort_values('mean', ascending=False)

print("Salary statistics by state for all industries (sorted by mean salary):")
print(all_state_stats)

Salary statistics by state for all industries (sorted by mean salary):
                                                       min       mean  \
state
Michigan, Texas, Washington                         340000  340000.00
Indiana, Ohio                                       245000  245000.00
Alaska                                               27040  232275.08
Colorado, Nevada                                    190000  190000.00
California, Montana                                 185000  185000.00
...                                                    ...        ...
Delaware, Pennsylvania                               35000   35000.00
District of Columbia, Washington                     35000   35000.00
Alabama, California                                  29120   29120.00
District of Columbia, Maryland, Pennsylvania, V...   27040   27040.00
Maryland, New York                                   14000   14000.00

                                                         max
state
Michigan, Texas, Washington                           340000
Indiana, Ohio                                         245000
Alaska                                              10000000
Colorado, Nevada                                      190000
California, Montana                                   185000
...                                                      ...
Delaware, Pennsylvania                                 35000
District of Columbia, Washington                       35000
Alabama, California                                    29120
District of Columbia, Maryland, Pennsylvania, V...     27040
Maryland, New York                                     14000

[130 rows x 3 columns]

<>:3: SyntaxWarning: invalid escape sequence '\$'
<>:3: SyntaxWarning: invalid escape sequence '\$'
/var/folders/m6/nzr_jy21479579073nm09q3m0000gn/T/ipykernel_54263/228111693.py:3: SyntaxWarning: invalid escape sequence '\$'
  df_salary['salary'] = df_salary['salary'].replace('[\$,]', '', regex=True)

### Bonus #1

This time, format the table output nicely (*$12,345.00*) without modifying the values in the `DataFrame`. That is, `df_salary` should be identical before versus after running your code.

(*Hint: if you run into an error about `jinja2` perhaps you need to `pip install` something.*)

In [99]:
# Format the table with currency formatting
pd.options.display.float_format = '${:,.2f}'.format

print("Salary statistics by state for all industries (sorted by mean salary):")
print(all_state_stats)

Salary statistics by state for all industries (sorted by mean salary):
                                                       min        mean  \
state
Michigan, Texas, Washington                         340000 $340,000.00
Indiana, Ohio                                       245000 $245,000.00
Alaska                                               27040 $232,275.08
Colorado, Nevada                                    190000 $190,000.00
California, Montana                                 185000 $185,000.00
...                                                    ...         ...
Delaware, Pennsylvania                               35000  $35,000.00
District of Columbia, Washington                     35000  $35,000.00
Alabama, California                                  29120  $29,120.00
District of Columbia, Maryland, Pennsylvania, V...   27040  $27,040.00
Maryland, New York                                   14000  $14,000.00

                                                         max
state
Michigan, Texas, Washington                           340000
Indiana, Ohio                                         245000
Alaska                                              10000000
Colorado, Nevada                                      190000
California, Montana                                   185000
...                                                      ...
Delaware, Pennsylvania                                 35000
District of Columbia, Washington                       35000
Alabama, California                                    29120
District of Columbia, Maryland, Pennsylvania, V...     27040
Maryland, New York                                     14000

[130 rows x 3 columns]

### Bonus #2

Filter out the non-single-states (e.g., `'California, Colorado'`) in the most elegant way possible (i.e., *not* by blacklisting all the bad values).

In [100]:
# Filter out multi-state entries
single_state_data = df_salary_clean[~df_salary_clean['state'].str.contains(',', na=False)]

# Calculate statistics for single states only
single_state_stats = single_state_data.groupby('state')['salary'].agg(['min', 'mean', 'max']).round(2)
single_state_stats = single_state_stats.sort_values('mean', ascending=False)

print("Salary statistics by single states (sorted by mean salary):")
print(single_state_stats)

Salary statistics by single states (sorted by mean salary):
                        min        mean       max
state
Alaska                27040 $232,275.08  10000000
California                0 $114,349.58    875000
Washington               72 $107,888.45   1260000
District of Columbia     40 $106,662.21   1334782
New York                 80 $105,281.29   3000000
New Jersey            14850 $101,132.50   5000044
Massachusetts           155  $98,733.04   1650000
Virginia                 57  $94,689.10   1300000
Connecticut               0  $93,572.51   1900000
Illinois                  0  $90,366.20   1100000
Colorado                 65  $89,671.73    630000
Maryland                  0  $89,437.60    353200
Oregon                    0  $89,010.77    320000
Texas                     0  $88,889.84   1200000
Delaware              35000  $87,502.46    220000
Georgia                   0  $86,772.42    860000
Utah                  18720  $86,462.05    576000
Florida                 150  $83,580.73   2600000
Pennsylvania              0  $83,246.47   1100000
New Mexico               78  $81,900.23    300000
Minnesota                40  $81,777.93    321250
North Carolina         4000  $80,999.28    560000
Nevada                   55  $80,812.60    425000
Arizona               12000  $79,863.53    380000
Hawaii                12000  $77,699.47    500000
Rhode Island          18000  $77,301.97    200000
Michigan                 55  $76,628.81    500000
Wisconsin                 1  $76,416.31    920000
Ohio                     36  $75,989.98    954000
Tennessee             20800  $75,916.77    657900
Missouri                 70  $75,242.10    335000
Arkansas              26000  $74,712.41    488000
New Hampshire            55  $73,277.58    208000
Louisiana             17000  $72,963.20    253300
Indiana                 105  $72,820.48    925000
Kansas                   52  $72,063.20    734400
Nebraska              18000  $71,789.83    224000
Alabama                  54  $71,092.09    350000
Vermont               24960  $70,534.93    200000
Idaho                    38  $70,439.80    312000
Iowa                  13000  $68,835.44    200000
Oklahoma              18000  $66,131.17    180000
Kentucky                  0  $65,872.58    208000
South Carolina            0  $65,774.50    250000
Maine                 22000  $64,920.46    173000
South Dakota          29000  $64,214.36    150000
North Dakota              0  $62,174.34    150000
Montana               19200  $61,358.68    172000
Mississippi           25000  $61,282.45    130000
Wyoming               29000  $58,896.65    140000
West Virginia             0  $58,664.17    125000

### Bonus #3

Show the quantiles instead of just minimum, mean, and maximum‚Äïsay 0%, 5%, 25%, 50%, 75%, 95%, and 100%. Outliers may be deceiving.

Sort by whatever interests you‚Äïlike say the *50th* percentile.

And throw in a count by state too. It would be interesting to know how many data points contribute to the figures for each state. (*Hint: your nice formatting from Bonus #1 might not work this time around.* üòú)

In [101]:
# Reset display format for numbers
pd.options.display.float_format = None

# Calculate quantiles and count for each state
quantiles = [0, 0.05, 0.25, 0.50, 0.75, 0.95, 1.0]
state_stats = single_state_data.groupby('state')['salary'].agg([
    ('count', 'count'),
    *[(f'p{int(q*100)}', lambda x, q=q: x.quantile(q)) for q in quantiles]
]).round(2)

# Sort by median (p50)
state_stats = state_stats.sort_values('p50', ascending=False)

# Format currency for all columns except count
for col in state_stats.columns[1:]:  # Skip 'count'
    state_stats[col] = state_stats[col].apply(lambda x: f"${x:,.2f}")

print("Salary statistics by state with quantiles and count (sorted by median salary):")
print("\nColumns:")
print("count: Number of data points")
print("p0: Minimum (0th percentile)")
print("p5: 5th percentile")
print("p25: 25th percentile")
print("p50: Median (50th percentile)")
print("p75: 75th percentile")
print("p95: 95th percentile")
print("p100: Maximum (100th percentile)")
print("\nData:")
print(state_stats)

Salary statistics by state with quantiles and count (sorted by median salary):

Columns:
count: Number of data points
p0: Minimum (0th percentile)
p5: 5th percentile
p25: 25th percentile
p50: Median (50th percentile)
p75: 75th percentile
p95: 95th percentile
p100: Maximum (100th percentile)

Data:
                      count          p0          p5         p25          p50  \
state
California             2589       $0.00  $42,000.00  $72,000.00  $100,360.00
Washington             1181      $72.00  $40,000.00  $65,000.00   $91,000.00
New York               2169      $80.00  $40,688.00  $64,480.00   $90,000.00
District of Columbia    975      $40.00  $48,000.00  $66,700.00   $90,000.00
Massachusetts          1518     $155.00  $42,000.00  $64,000.00   $86,000.00
Maryland                563       $0.00  $40,100.00  $60,000.00   $82,000.00
Connecticut             236       $0.00  $33,787.50  $61,750.00   $81,900.00
Delaware                 46  $35,000.00  $41,704.00  $58,869.75   $81,322.50
Virginia                780      $57.00  $37,380.00  $58,750.00   $80,616.50
Oregon                  620       $0.00  $36,380.00  $58,800.00   $78,000.00
Texas                  1258       $0.00  $35,155.80  $55,000.00   $76,000.00
Colorado                630      $65.00  $38,939.00  $58,000.00   $76,000.00
Illinois               1205       $0.00  $37,452.00  $56,000.00   $76,000.00
Minnesota               717      $40.00  $39,520.00  $55,000.00   $75,000.00
New Jersey              396  $14,850.00  $35,270.00  $57,750.00   $75,000.00
Georgia                 534       $0.00  $32,000.00  $53,125.00   $75,000.00
North Carolina          600   $4,000.00  $34,491.00  $51,000.00   $73,500.00
Utah                    207  $18,720.00  $33,796.00  $54,175.00   $72,807.00
Alaska                   64  $27,040.00  $40,000.00  $56,500.00   $72,400.00
Rhode Island             76  $18,000.00  $35,950.00  $51,250.00   $71,500.00
Nevada                   92      $55.00  $33,753.10  $51,500.00   $70,500.00
Pennsylvania            940       $0.00  $33,142.50  $52,000.00   $70,492.00
New Mexico               98      $78.00  $33,892.00  $52,000.00   $69,000.00
Michigan                543      $55.00  $32,000.00  $52,260.00   $67,500.00
Ohio                    652      $36.00  $33,000.00  $50,000.00   $67,250.00
Florida                 518     $150.00  $31,200.00  $47,880.00   $67,000.00
Arizona                 300  $12,000.00  $34,000.00  $50,000.00   $66,850.00
Wisconsin               468       $1.00  $34,000.00  $50,000.00   $66,280.00
Missouri                340      $70.00  $30,500.00  $47,755.00   $65,260.00
New Hampshire           118      $55.00  $30,983.20  $46,200.00   $65,000.00
Indiana                 328     $105.00  $33,050.00  $48,825.00   $65,000.00
Nebraska                108  $18,000.00  $32,947.85  $45,073.50   $64,000.00
Tennessee               281  $20,800.00  $33,000.00  $47,500.00   $63,500.00
Hawaii                   30  $12,000.00  $31,107.00  $53,250.00   $62,850.00
Louisiana               129  $17,000.00  $30,272.00  $47,000.00   $62,500.00
Iowa                    178  $13,000.00  $30,000.00  $47,840.00   $62,500.00
Vermont                  67  $24,960.00  $32,300.00  $50,000.00   $62,000.00
Kansas                  153      $52.00  $33,600.00  $45,000.00   $61,000.00
South Dakota             25  $29,000.00  $31,560.00  $45,750.00   $60,000.00
Alabama                 117      $54.00  $27,600.00  $45,600.00   $60,000.00
Idaho                    97      $38.00  $30,960.00  $46,000.00   $60,000.00
Arkansas                 69  $26,000.00  $30,680.00  $46,000.00   $60,000.00
Kentucky                190       $0.00  $29,000.00  $43,545.00   $59,317.50
North Dakota             35       $0.00  $27,584.00  $45,000.00   $59,000.00
Maine                   125  $22,000.00  $34,511.20  $43,000.00   $58,500.00
South Carolina          146       $0.00  $29,152.50  $43,140.00   $56,250.00
Oklahoma                113  $18,000.00  $27,521.60  $43,000.00   $54,000.00
Mississippi              49  $25,000.00  $31,080.00  $36,663.00   $53,000.00
Wyoming                  23  $29,000.00  $31,803.20  $43,250.00   $50,004.00
West Virginia            41       $0.00  $27,000.00  $41,000.00   $49,088.00
Montana                  63  $19,200.00  $33,557.20  $37,250.00   $48,000.00

                              p75          p95            p100
state
California            $147,000.00  $220,000.00     $875,000.00
Washington            $135,000.00  $201,000.00   $1,260,000.00
New York              $127,000.00  $210,600.00   $3,000,000.00
District of Columbia  $125,000.00  $189,300.00   $1,334,782.00
Massachusetts         $120,000.00  $180,300.00   $1,650,000.00
Maryland              $110,000.00  $165,000.00     $353,200.00
Connecticut           $100,000.00  $162,500.00   $1,900,000.00
Delaware              $105,750.00  $164,247.50     $220,000.00
Virginia              $115,000.00  $180,000.00   $1,300,000.00
Oregon                $110,000.00  $185,000.00     $320,000.00
Texas                 $110,000.00  $175,000.00   $1,200,000.00
Colorado              $110,750.00  $165,275.00     $630,000.00
Illinois              $110,000.00  $171,600.00   $1,100,000.00
Minnesota             $100,000.00  $150,000.00     $321,250.00
New Jersey            $104,250.00  $177,600.00   $5,000,044.00
Georgia               $105,000.00  $173,700.00     $860,000.00
North Carolina         $98,000.00  $150,000.00     $560,000.00
Utah                  $100,500.00  $175,700.00     $576,000.00
Alaska                 $90,500.00  $144,550.00  $10,000,000.00
Rhode Island           $93,875.00  $134,250.00     $200,000.00
Nevada                 $95,100.00  $167,250.00     $425,000.00
Pennsylvania          $100,200.00  $165,100.00   $1,100,000.00
New Mexico            $107,000.00  $166,800.00     $300,000.00
Michigan               $90,500.00  $147,819.20     $500,000.00
Ohio                   $89,261.25  $150,000.00     $954,000.00
Florida                $97,875.00  $162,150.00   $2,600,000.00
Arizona               $100,000.00  $155,100.00     $380,000.00
Wisconsin              $90,000.00  $146,300.00     $920,000.00
Missouri               $94,125.00  $145,000.00     $335,000.00
New Hampshire          $88,875.00  $142,734.75     $208,000.00
Indiana                $84,752.50  $134,300.00     $925,000.00
Nebraska               $88,250.00  $138,250.00     $224,000.00
Tennessee              $85,000.00  $157,000.00     $657,900.00
Hawaii                 $75,000.00  $123,100.00     $500,000.00
Louisiana              $85,000.00  $150,000.00     $253,300.00
Iowa                   $87,500.00  $123,087.50     $200,000.00
Vermont                $83,000.00  $124,400.00     $200,000.00
Kansas                 $81,000.00  $125,000.00     $734,400.00
South Dakota           $66,805.00  $126,800.00     $150,000.00
Alabama                $85,000.00  $141,200.00     $350,000.00
Idaho                  $78,000.00  $130,000.00     $312,000.00
Arkansas               $85,000.00  $144,600.00     $488,000.00
Kentucky               $78,000.00  $130,000.00     $208,000.00
North Dakota           $75,000.00  $110,500.00     $150,000.00
Maine                  $83,000.00  $114,800.00     $173,000.00
South Carolina         $78,937.50  $128,148.75     $250,000.00
Oklahoma               $80,000.00  $142,200.00     $180,000.00
Mississippi            $82,000.00  $113,600.00     $130,000.00
Wyoming                $71,500.00   $97,200.00     $140,000.00
West Virginia          $71,400.00  $117,516.00     $125,000.00
Montana                $83,500.00  $125,800.00     $172,000.00